app/views/houses/show.html.erb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."house_id" = $1  [["house_id", 2]]
---

  <%= render 'house', :house => @house, :locals => {:path => rooms_path(Room.where(house_id: @house.id).each { |r| r.id})} %>