app/views/rooms/index.html.erb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT 1  [["id", 1]]
---
  <% @rooms.each do |room| %>
      <%= render 'room', {:house => House.find(room.house_id), :room => room} %>