app/controllers/doors_controller.rb

INSERT INTO "doors" ("value", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["value", "0"], ["room_id", 2], ["created_at", "2015-09-08 15:42:55.414059"], ["updated_at", "2015-09-08 15:42:55.414059"]]
---
  def create
    @door = Door.new(doors_params)
    @door.save