app/controllers/houses_controller.rb

INSERT INTO "houses" ("name", "street_address", "city", "state", "country", "postal_code", "owner", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @house = House.new(house_params)
    @house.save

UPDATE "houses" SET "name" = $1, "street_address" = $2, "updated_at" = $3 WHERE "houses"."id" = $4  [["name", "Pešina Kuća"], ["street_address", "Bosanska ulica 18"], ["updated_at", "2015-09-09 19:00:44.967878"], ["id", 4]]
---
  def update
    @house = House.find(params[:id])
    @house.update(house_params)

DELETE FROM "houses" WHERE "houses"."id" = $1  [["id", 2]]
---
  def destroy
    @house = House.find(params[:id])
    @house.destroy