app/controllers/rooms_controller.rb

  def index
    ids = params[:format].split('/') if params[:format]
    @rooms = Room.all if not params[:format]
    @rooms = ids.map do |id|
      Room.find_by_id(id)
---
SELECT "rooms".* FROM "rooms"
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @room = Room.new(room_params)
    @room.save
---
INSERT INTO "rooms" ("name", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Spavaća soba"], ["house_id", 4], ["created_at", "2015-08-16 01:22:09.606525"], ["updated_at", "2015-08-16 01:22:09.606525"]]

  def show
    @room = Room.find(params[:id])
    @temperatures = Temperature.where(room_id: @room.id)
    @doors = Door.where(room_id: @room.id)
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "temperatures".* FROM "temperatures" WHERE "temperatures"."room_id" = $1  [["room_id", 1]]
SELECT "doors".* FROM "doors" WHERE "doors"."room_id" = $1  [["room_id", 1]]

  def edit
    @room = Room.find(params[:id])
    @house = House.order(@room.house_id)
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = $1 LIMIT 1  [["id", 4]]

  def update
    @room = Room.find(params[:id])
    @room.update(room_params)
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "rooms" SET "name" = $1, "updated_at" = $2 WHERE "rooms"."id" = $3  [["name", "asdasdsadasd"], ["updated_at", "2015-08-29 13:47:12.478037"], ["id", 5]]

  def destroy
    @room = Room.find(params[:id])
    @room.destroy
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "rooms" WHERE "rooms"."id" = $1  [["id", 4]]