app/controllers/temperatures_controller.rb

  def create
    @temperature = Temperature.new(temperature_params)
    @temperature.save
---
INSERT INTO "temperatures" ("value", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["value", "32"], ["room_id", 1], ["created_at", "2015-08-16 17:35:57.346302"], ["updated_at", "2015-08-16 17:35:57.346302"]]